{
  "rules": [
    "A turn cannot have an upkeep but a player can.",
    "If a card has a mana cost that is variable by paying {X}, or an ability where the player can pay a variable amount by paying {X}, the effect gained by paying {X} should scale based on the amount of mana paid for X.",
    "If a card references its flashback cost, it should explicitly state the amount of mana that flashback costs. The flashback cost usually costs more than the mana cost of the card.",
    "Making the card become an artifact should cost at most 1 colorless mana."
  ]
}

{
  "cards": [
    {
      "name": "Flameblast Phoenix",
      "manaCost": "{2}{R}{R}",
      "type": "Creature — Phoenix",
      "text": "Flying, haste\nWhen Flameblast Phoenix enters the battlefield, it deals 4 damage to target player or planeswalker.\n{2}{R}{R}, Exile Flameblast Phoenix from your graveyard: Create a red Instant card named Flameblast with \"Flameblast deals 4 damage to any target.\" Then exile Flameblast. Activate this ability only any time you could cast a sorcery.",
      "flavorText": "\"The most terrifying fireworks display I've ever seen.\" —Javad Nasrin, ordruun duelist",
      "pt": "3/2",
      "rarity": "Rare",
      "reason": "A powerful and flavorful phoenix that captures the essence of the plane of Dominaria while utilizing the flashback ability.",
      "funnyReason": "After realizing how many R&D meetings were held in the Phoenix Theater in downtown Seattle, it was only a matter of time before a card with flashBlack Friday was printed."
    },
    {
      "name": "Zombie Infestation",
      "manaCost": "{1}{B}",
      "type": "Enchantment",
      "text": "Discard two cards: Create a 2/2 black Zombie creature token.\nFlashback {1}{B}{B}",
      "flavorText": "The chains of reason crumble in the face of true hunger.",
      "pt": null,
      "rarity": "Uncommon",
      "reason": "An efficient and flavorful design that utilizes the flashback mechanic to create an endless army of zombies.",
      "funnyReason": "We could have called this card \"Cardboard Box Forts\" because of all the trash you'll be filling your graveyard with."
    }
  ]
}


{
  "cards": [
    {
      "name": "Temporal Retaliation",
      "manaCost": "{2}{R}{U}",
      "type": "Instant",
      "text": "Temporal Retaliation deals 2 damage to target creature. If it was kicked, it deals 6 damage instead. Flashback {4}{R}{U}",
      "flavorText": "With the knowledge of future events, a wise mage exacts revenge on the ones who wronged them in the past.",
      "pt": "",
      "rarity": "Rare",
      "reason": "The combination of red and blue colors creates a spell with a unique effect. Flashback fits well in a spell that deals with time manipulation.",
      "funnyReason": "We wanted to create a spell that doesn't only deal damage, but also deals with the past in a fun and flashy way."
    },
    {
      "name": "Undying Profanity", [Not a bad card.]
      "manaCost": "{2}{B}{G}",
      "type": "Sorcery",
      "text": "Destroy target creature. If this spell was cast from a graveyard, also destroy an artifact or enchantment. Flashback {4}{B}{G}",
      "flavorText": "The necromancer invoked ancient spells of profanity, his hatred as immortal as his undead army.",
      "pt": "",
      "rarity": "Rare",
      "reason": "Black and green are known for their resurrection and graveyard manipulation effects, but also for their hatred for artifacts and enchantments. Flashback is a perfect fit for a spell that can be used in multiple situations.",
      "funnyReason": "We were feeling a bit mischievous and wanted to give players the possibility to destroy as much as possible, in as many ways as possible." 
    },
    {
      "name": "Frostbite Phoenix",
      "manaCost": "{2}{R}{R}",
      "type": "Creature — Phoenix",
      "text": "Flying\nWhen Frostbite Phoenix enters the battlefield, it deals 2 damage to target creature or player.\nFlashback {4}{R}",
      "flavorText": "As winter wears on, the phoenix's fiery plumage grows increasingly encased in ice. Its burning heart still beats, but only with the aid of powerful magic.",
      "pt": "2/2",
      "rarity": "Rare",
      "reason": "I thought it would be interesting to have flashback on a creature, and a phoenix seemed like a great fit for the Dominaria plane.",
      "funnyReason": "Because this phoenix just can't seem to stay dead. It keeps coming back, even when you thought you'd seen the last of it (thanks to flashback, of course)." 
    }
  ]
}

{
  "cards": [
    {
      "name": "Temporal Echoes",
      "manaCost": "{3}{U}",
      "type": "Instant",
      "text": "Draw two cards, then exile this card from your graveyard. You may cast this card from exile by paying {3} rather than paying its mana cost.",
      "flavorText": "The echoes of the past can help shape the present.",
      "pt": "",
      "rarity": "Rare",
      "reason": "I wanted to create a card that felt useful in a pinch but didn't have the drawback of needing to discards cards, which is pretty common with many blue cards with flashback. The idea of drawing cards and having an ability to cast the card for cheap from exile seemed fitting for a complex card.",
      "funnyReason": "I made this card so players could have more reasons to hoard their graveyard cards!"
    },
    {
      "name": "Chaos Revelations",
      "manaCost": "{2}{R}",
      "type": "Sorcery",
      "text": "Chaos Revelations deals 4 damage to target creature. Exile Chaos Revelations from your graveyard. You may cast this card from exile by paying {1}{R}{R} rather than paying its mana cost.",
      "flavorText": "\"Chaos is not always bad. Just... usually.\" - Jaya Ballard",
      "pt": "",
      "rarity": "Uncommon",
      "reason": "I wanted to create a card that could be useful for damaging creatures while also being useful later in the game. Giving the player an option to cast the cards from exile on the cheap seemed fitting for a card themed around chaos magic.",
      "funnyReason": "I made this card so that players could be the cause of their own chaos!"
    }
  ]
}